
/* --------------- Application configuration strings ----------------------- */

/* iMovie Audio Effect strings */
imaeGraphicEQ = "  Graphic EQ";
imaeReverb = "  Reverb";
imaeDelay = "  Delay";
imaePitchChanger = "  Pitch Changer";
imaeHighpass = "  Highpass";
imaeLowpass = "  Lowpass";
imaeBandpass = "  Bandpass";
imaeNoiseReducer = "  Noise Reducer";

/* App name */
AppName = "iMovie HD";
VersionFormat = "%@";	/* for example, "1.1 (2A10)" */
AboutFormat = "%@ %@";		/* AppName VersionFormat */

/* iDVD app name */
IDVDAppName = "iDVD";

/* Help: name of the application help book. */
iMovieHelp-bookName = "iMovie Help";
/* Help: name of the keyboard shortcuts anchor in the help file */
iMovieHelp-keyboardShortcuts = "imov002";
/* Help: the name of the anchor for camera connection help */
iMovieHelp-cameraConnectionHelp = "imovcam";
/* Path to the Getting Started Application */
iMovieHelp-GettingStartedPath = "/Library/Documentation/Applications/iMovie/iMovie Getting Started.app";
/* Getting Started Error Messages */
iMovieHelp-GettingStarted-Error-Title = "Cannot Find Getting Started";
iMovieHelp-GettingStarted-Error-Message = "The Getting Started file has been moved or deleted.";

/* Web sites */
WebSiteURL = "http://www.apple.com/%@/";
/* currently no redirect page set up for "http://www.apple.com/iMovie/buy/" */
WebBuyURL = "http://www.apple.com/%@/buy/";
WebBuyRealURL = "http://www.apple.com/digitalhub/buy/movies.html";
FeedbackURL = "http://www.apple.com/feedback/imovie.html";
RegisterApplicationURL = "http://www.apple.com/register/imovie.html";
HotTipsURL = "http://www.apple.com/support/imovie/hottips";
/* iTunesStoreURL = "http://phobos.apple.com/WebObjects/MZStore.woa/"; */
SupportURL = "http://www.apple.com/support/imovie/";

/* descriptions of video formats */
NTSCDescription = "DV is the primary video format compatible with most camcorders.";
NTSCWideDescription = "DV Widescreen is the same format as DV except it uses a 16:9 aspect ratio.";
PALDescription = "DV is the primary video format compatible with most camcorders.";
PALWideDescription = "DV Widescreen is the same format as DV except it uses a 16:9 aspect ratio.";
MPEGDescription = "MPEG-4 is a video format compatible with many consumer video devices including digital cameras.";
HDV720p2997Description = "HDV 720p is a High Definition (HD) video format compatible with HDV camcorders.";
HDV1080i2997Description = "HDV 1080i is a High Definition (HD) video format compatible with HDV camcorders.";
HDV720p25Description = "HDV 720p is a High Definition (HD) video format compatible with HDV camcorders.";
HDV1080i25Description = "HDV 1080i is a High Definition (HD) video format compatible with HDV camcorders.";
IsightDescription = "iSight is a video format compatible with the Apple iSight video camera.";

/* -------------------------------------------------------------------------------------------------------------------------------------
** default video format
** localizers: please select "DV-NTSC" or "DV-PAL" depending on the most popular video format in your country
** -----------------------------------------------------------------------------------------------------------------------------------*/
	
defaultVideoFormat = "DV-NTSC";  

/* -------------------------------------------------------------------------------------------------------------------------------------
** Video format strings
** -----------------------------------------------------------------------------------------------------------------------------------*/

_loc_DV_NTSC_Format = "DV-NTSC";
_loc_DV_NTSC_Wide_Format = "DV-NTSC-Widescreen";

_loc_DV_PAL_Format = "DV-PAL";
_loc_DV_PAL_Wide_Format = "DV-PAL-Widescreen";

_loc_HDV_720_P_2997_Format = "HD-720p-30";
_loc_HDV_720_P_25_Format = "HD-720p-25";

_loc_HDV_1080_I_2997_Format = "HD-1080i-30";
_loc_HDV_1080_I_25_Format = "HD-1080i-25";

_loc_MPEG4_Format = "MPEG-4";

_loc_ISIGHT-II-DC_Format = "iSight";

/* Probably should NOT localize this. This is the format for the window title. For example, "My Great Movie (DV-NTSC)".
** Only localize if the parenthesis are inappropriate for some languages.
fix <rdar://problem/4217845> [Tier3-iMovie] Problem with brackets when project name starts with Hebrew/Arabic and finishes with a Roman character
This value now has a   Left-To-Right Embedding (U202A)  before the starting paren.
*/
ProjectWindowTitleFormat = "%@ ‪(%@)";

ConvertWrongAspectRatio = "One or more imported clips have the wrong aspect ratio.  Would you like iMovie HD to convert these for you?";
LetterboxClips = "The clips will be letterboxed.";
PillarboxClips = "The clips will be pillarboxed.";
Pillarboxing = "Pillarboxing";
Letterboxing = "Letterboxing";
UpdatingFiles = "Updating files";
PleaseWait = "Please wait.  This may take a while.";

/* default title font
** this name must be a POSTSCRIPT font name (as returned by [NSFont fontName]) */
defaultTitleFont = "Arial-Black";

/* default date format - this is only used if the system prefs date format lookup fails
** currently only used by clip info inspector window */
defaultDateFormat = "%b %d, %Y";

/* DO NOT LOCALIZE the following. It determines the default directory within the
   users home directory where we save movies. While the finder may show this as
   some other name (e.g. Peliculas), this is "finder magic." The directories
   on the filesystem itself are not actually localized when they are created. */
defaultMoviesDirectory = "Movies";

/* Default name shown in the new project dialog */
defaultNameForNewProject = "My Great Movie";

/* string appended to name of reference movie that is created in the movie's
   project directory every time the project is saved. Must end in .mov.
   Affects detection of stray clips. */
referenceMovieSuffix = ".mov";

/* badge text that appears in clips that have effects applied to them */
fxBadgeText = "fx";

/* localizers can change the default video format here */
"Default to PAL or NTSC" = "NTSC";

/* base clip names */
baseClipNameVideo = "Clip";	  
baseClipNameStill = "Still";  
baseClipNameVoice = "Voice"; 
baseClipNameExtractedAudio = "Extracted Audio";
baseClipNameRenderingAudio = "Rendering Audio";
	

/* ------------ strings that appear in the main window ---------------------- */

/* string appended to disk space remaining text that appears in the bottom
   of the main app window, e.g. '30 GB free.'
   note: GB, MB, KB, etc are in the EnumeratedStrings.plist file. */
freeDiskSpaceBarFormat = "%@ available";

/* used during multiple selection -- refers to multiple clips */
PluralStringForClip = "Clips";  
/* used during multiple selection -- referes to selection of audio AND video clips */
AudioAndVideoSelection = "Selection:";  

/* selection info strings */
Selection_None = "%@ total duration";
Selection_Timeline_Single = "“%@”  %@ of %@ total";
Selection_Timeline_Single_WithDate = "“%@”  %@  %@ of %@ total";
Selection_Timeline_Multiple = "%ld items selected  %@ of %@ total";
Selection_Timeline_Frames = "Frames selected  %@ of %@ total";
Selection_Shelf_Single = "“%@”  %@";
Selection_Shelf_Single_WithDate = "“%@”  %@  %@";
Selection_Shelf_Multiple = "%ld items selected  %@";
Selection_Shelf_Frames = "Frames selected  %@";

/* Timeline messages */
"TimelineMessage_DragClipsHere" = "Drag clips here to build your project.";
"TimelineMessage_DragPhotosHere" = "Drag photos here to build your project.";
"TimelineMessage_DragTitlesHere" = "Drag titles here to build your project.";
"TimelineMessage_DragAudioHere" = "Drag audio here to build your project.";

/* -------------------- Dialog message strings ---------------------------- */

/* --- Common Alert Buttons used in almost all iMovie dialogs --- */
OK = "OK"; /* sometimes the AppKit localization is used for this */
Continue = "Continue";
Cancel = "Cancel";

/* --- error-on-launch dialog messages --- */
BadScreenRez = "To use iMovie HD, your screen size must be set to at least 1024 x 720.";
SetScreenRezRelaunch = "Reset your screen size in the Displays pane of System Preferences, then open iMovie HD.";
SetScreenRezAlreadyRunning = "The screen size has been changed to less than 1024 x 720. The application will now quit.";

ImproperVersionOfQuickTimeTitle = "QuickTime Update Needed";
ImproperVersionOfQuickTimeMsg = "iMovie HD requires QuickTime version %d.%d.%d or later, which can be downloaded for free from www.apple.com/quicktime.";

AlreadyRunning = "There is another copy of iMovie HD running.";
MustQuit = "The application must now quit.";

/* Mac OS version warning dialog */
/* the 'space' at the end of this string is important.  Please preserve. */
versionAlert-unableToLaunch = "iMovie HD requires Mac OS X v%@ or later. For more information on upgrading your computer, visit ";
/* the 'period' at the end of this string is important.  Please preserve. */
versionAlert-OSXURL = "www.apple.com/macosx.";
versionAlert-quitButton = "Quit";

/* Processor not allowed */
cpuAlert-unableToLaunch = "This version of iMovie HD cannot run on a G3 Computer.";

/* Warn about Quartz Extreme missing */
quartzExtremeAlert-title = "Your computer contains a graphics card which may not support iMovie.";
quartzExtremeAlert-message = "iMovie requires a “Quartz Extreme Compatible” graphics card. Certain iMovie features such as Themes, Ken Burns Photos, and Video FX may not work properly with your graphics card.";
quartzExtremeAlert-launchButton = "Launch iMovie";
quartzExtremeAlert-quitButton = "Quit";

/* Drag-installed iMovie to older OS */
missingAppleVA-title = "Missing or old System Component";
missingAppleVA-msg = "The system components “AppleVA.framework” and/or “AppleVADriver.bundle” are either missing or are out-of-date. They are included with OS 10.3.6 and later. HDV Support will be disabled until these components are installed or updated.";
missingiCodec-title = "Missing HD QuickTime Component";
missingiCodec-msg = "The QuickTime component necessary to view, edit, import and export high-definition movies is not installed. It is included with the iMovie HD installer; please re-install.";
missingQuartz-title = "Missing or old System Component";
missingQuartz-msg = "Cannot find the needed version of Quartz. It is included with the iMovie HD installer; please re-install iMovie to get the needed support frameworks.";

/* Other HDV-is-not-your-friend messages */
HDVTooSlow-title = "This Computer Does Not Support HD";
HDVTooSlow-msg = "To use the HD features of iMovie HD, you should use a G4 or G5 (%2.1f GHz or faster), and have at least %d MB of RAM. You can proceed, but you might not be able to capture every frame of video from a camera, or smoothly play video.";
HDVUnsupported-msg = "To use the HD features of iMovie HD, you must use a G4 or G5 computer.";

/* "No project open" dialog box */
noProject-title = "Welcome To iMovie HD";
noProject-msg = "There is no project open. What would you like to do?";
noProject-createBtn = "Create Project…";
noProject-openBtn = "Open Existing Project…";
noProject-quitBtn = "Quit";

/* "project is in the trash" dialog box */
projectInTrash-title = "The document “%@” could not be opened because it is in the Finder’s Trash.";
projectInTrash-msg = "To use this item, drag it out of the Finder’s Trash first.";

/* "project needs to be upgraded" dialog box */
projectUpgrade-title = "Warning";
projectUpgrade-msg = "The project “%@” was saved with an older version of iMovie HD. Opening it in this version will cause it to be upgraded, which will make it unreadable by older versions. Are you sure you want to open it?";

/* unreadable project recovery */
projectUnreadableWithBackup-title = "Project File is Not Readable";
projectUnreadableWithBackup-msg = "The main project file couldn't be read, but a backup copy exists. If you try to open the backup and it succeeds, you may have problems with missing media if you have recently emptied iMovie HD’s trash. You should also save the project immediately.";
projectUnreadableWithBackup-btn = "Try Backup";

/* "Can't create new project" dialog */
cantCreateNewProject-title = "The new project couldn't be created.";
cantCreateNewProject-msg = "The disk may be locked, read-only, or completely full. Try saving to a different location.";

/* New stray files dialog */
strayFiles-title = "Some stray files were found in the project";
strayFiles-msg = "Files that iMovie can understand are in iMovie’s Trash. Any other files have been moved into the Finder’s Trash. Would you like to view iMovie’s Trash contents now?";
strayFiles-button1 = "View Trash";
strayFiles-button2 = "Don’t View Trash";

/* missing files during project open - 2nd arg is button name. */
cantOpenFileOnLoad-title = "A Project File is Missing";
cantOpenFileOnLoad-msg = "The file “%@” couldn’t be opened and is being skipped. Click “%@” to skip any remaining missing file messages.";
cantOpenFileOnLoad-button = "Ignore All";

/* "confirm save to project" dialog */
confirmSave-title = "You have made changes to your project “%@” that have not been saved.";
confirmSave-msg = "Would you like to save them?";
confirmSave-saveBtn = "Save";
confirmSave-dontSaveBtn = "Don’t Save"; 

/* can't save project because idiot user moved it while open . arg1 is path to project folder */
cantSaveProjectMissing-Title = "Your Project File Is Missing";
cantSaveProjectMissing-Msg = "The project has been moved while open. Please move it back, and choose “Try Again.” Or you can abort saving the project (you must close the project without saving changes). iMovie is expecting to find the project at “%@”.";
cantSaveProjectMissing-TryAgainBtn = "Try Again";
cantSaveProjectMissing-AbortBtn = "Abort";

/* Revert dialog */
revertDialog-title = "Do you want to revert to the most recently saved revision of the document “%@”?";
revertDialog-msg = "Your current changes will be lost.";
revertDialog-revertButton = "Revert";
revertDialog-cancelButton = "Cancel";

/* project save panel alerts */
badSaveLocation-title = "Invalid Project Location";
badSaveLocation-msg = "You are attempting to create a new project within an existing project. Please choose another folder.";
projectNameInvalid-title = "Invalid Project Name";
projectNameTooLong-msg = "Project names must be less than 240 characters.";
/* all-whitespace name */
projectNameInvalid-msg = "You are attempting to create a new project with an invalid name. Please choose another name."; 
projectNameAlreadyExists-title = "Project already exists";
projectNameAlreadyExists-msg = "A project with the name “%@” already exists. Please navigate out of this directory and choose another name.";
projectCouldntBeSaved = "The project could not be saved. The disk might be full or locked, or you might not have permission to save in the current location (%d).";

/* disk space critical */
diskSpaceCritical-title = "You are running dangerously low on disk space";
diskSpaceCritical-msg = "If you continue, you may not be able to save your project. You should immediately delete unused clips, or switch to the Finder to delete other files in order to make more space available.";

/* number formatter error dialog (P&Z duration, ClipInfo panel) */
InvalidValue = "Invalid Value";
InvalidValueErrorFormat = "%@. The value must be between %02d%@%02d and %02d%@%02d.";
SecondsAndFramesFormat = "Invalid timecode. Please use only numbers in the format “00:00” in seconds and frames. (There are %d frames in a second.)"; 

/* Dialog presented when exporting to iDVD and some other formats... */
sloMoRenderDialog-Title = "Your movie contains still, slow motion, and/or reverse clips which need to be rendered for this export.";
sloMoRenderDialog-Msg = "This will provide the best quality. Would you like to render them now?";
sloMoRenderDialog-defaultBtn = "Render and Proceed";
sloMoRenderDialog-btn2 = "Proceed Anyway";

/* --- messages in the export to QuickTime panel ---
   args are bytes, e.g. "99.9 MB to 1.36 GB" */
diskNeededHighAndLow = "Estimated size: %@ to %@.";
diskNeededExact = "Estimated size: about %@.";
/* same as above, but with one of the info strings from below. */
diskNeededHighAndLowWithDesc = "%@ Estimated size: %@ to %@.";
diskNeededExactWithDesc = "%@ Estimated size: about %@.";

exportMovieTo3GPPInfo = "Your movie will be compressed to 15 frames per second, approximately 160 x 120, with stereo sound.";
exportMovieToEmailInfo = "Your movie will be compressed to 10 frames per second, approximately 160 x 120, with monaural sound.";
exportMovieToWebInfo = "Your movie will be compressed to 12 frames per second, approximately 320 x 240, with medium-quality stereo sound.";
exportMovieToWebiWebInfo = "Your movie will be compressed to 12 frames per second, approximately 320 x 240, with medium-quality stereo sound.";
exportMovieToWebStreamingInfo = "Your movie will be compressed to 12 frames per second, approximately 320 x 240, medium-quality stereo sound. It will also have “hints” added to it to improve streaming performance.";
exportMovieToCDROMInfo = "Your movie will be compressed to 15 frames per second, approximately 320 x 240, with full-quality stereo sound.";
exportMovieToDVInfo = "Your movie will be copied into a single movie file at full quality.";
exportMovieToExpertInfo = "You can choose your own compression settings. The exported file size will depend on the options you choose.";
exportMovieToiPodInfo = "Your movie will be compressed to 30 frames per second, approximately 320 x 240, with H.264 video and 44.1kHz AAC stereo audio.";
ExportMovieDefaultInfo = "Your movie will be compressed with appropriate settings and may be reduced in width and height as well. This operation may take several minutes to complete.";
/* iPod export path override */
/* By default, iMovie will always write the movie to ~/Movies. If this is not desired, uncomment this next line. */
/* NOTE: changing the location in this may break the workflow into iTunes; the AppleScript which does the handoff */
/* does not know to look in any other location. (the path below may contain a tilde, which will be expanded) */
/* shareToiPodMoviePath = "~/Public/"; */

/* --- messages when connecting/importing from camera --- */
/* kCameraWrongStandard */
cameraConnectWrongStd-MenuText = " (Incompatible With Project)";
cameraConnectWrongStd = "Incompatible Camera Video Format"; 
cameraConnectWrongStd-msg =	"The attached camera uses a different video format than your project's format. To use this camera, disconnect any other tape-based cameras, then create a new, empty project."; 
cameraUnsupported-MenuText = " (Incompatible With Computer)";
cameraUnsupported-title = "HD Capture Is Not Possible";
cameraUnsupported-msg = "The attached camera is an HDV camera, in HDV transmit mode. HDV Capture is not supported on G3 computers.";

/* --- messages during export to camera --- */
kAlertCantExportToCamera = "Cannot Export To Camera"; 
/* the above string is the title for all of the following msgs */
cameraExportGeneralError-msg = "It is not possible to record to your camera.";
cameraExportWrongMode-msg = "Your camera must be in VTR mode (not Camera mode) in order to export to it. Please switch it to VTR mode and try again.";
cameraExportTapeProblem-msg = "Please check your camera to make sure the tape is in and the tape’s record tab is in the closed position.";
cameraExportCantFindCamera-msg = "Your FireWire camera is not powered on or is not available. This also can happen if you added or removed a device from FireWire. Please try again.";
exportNoTape-title = "Your camera does not appear to have a tape inserted, it is write-protected, or it may be a converter box.";
exportNoTape-msg = "Would you like to continue with Export?";
/* -- messages during export to HDV camera --- */
cameraExportHDVdiskFull-title = "Not Enough Disk Space";
/* arg1 is space required (MB/GB) arg2 is disk space available. */
cameraExportHDVdiskFull-msg = "The encoding phase of the export to HDV tape requires %@. Only %@ is available. Please free some space, or move your project to another disk with more space.";
cameraExportHDVMixingAudio = "Mixing Audio… (%2.0f%%)";
cameraExportHDVEncoding = "Encoding…";
cameraExportHDVWritingToTape = "Writing to Tape…";
cameraExportHDVError-title = "Exporter Error";
cameraExportHDVError-msg = "An unexpected error happened while aquiring the camera, mixing the audio, or encoding the project for export. Please try again. (%d)";
cameraExportDCLOverrun-msg = "iMovie HD was unable to transfer data to the camera fast enough, and as a result, your export may not be perfect. You may want to try again. Try quitting all other applications, and do not use the computer for anything else while the export runs.";

cameraExportHDVMakeAnother-title = "Export to another tape?";
cameraExportHDVMakeAnother-msg = "You can make additional copies of the movie without repeating the mixing and encoding steps. If you want to do this, please insert the next tape, and press “Make Another Copy” when ready.";
cameraExportHDVMakeAnother-noBtn = "No Thanks";
cameraExportHDVMakeAnother-yesBtn = "Make Another Copy";

/* progress messages during export to camera */
cameraExportProgressCancelling = "Cancelling…";
cameraExportProgressFinishing = "Finishing…";
cameraExportProgressTitle = "Exporting to Camera";
cameraExportProgressUpperText = "Exporting…";
cameraExportProgressStopBtn = "Stop";
cameraExportProgressRunningUpperText = "Exporting…";
cameraExportProgressRunningLowerText = "Preparing…";

/* error dialogs after export to camera */
cameraExportLostConn-title = "Lost Connection To Camera";
cameraExportLostConn-msg = "iMovie HD lost its connection to the video camera. Please check the connections and try again.";

/* export to DVD-ROM messages */
burnDVDROMnoDrive-title = "No Disc Burning Drive Found";
burnDVDROMnoDrive-msg = "If you have an apple-supported disc burner, please check your connections and try again.";
burnDVDROMexplain-title = "Create a Project Archive?";
burnDVDROMexplain-msg = "This feature creates a duplicate of your project onto a CD or DVD ROM. It does *not* create a video DVD for playing in a DVD player. Do you want to continue?";
burnDVDROMtooBig-title = "Project is too large.";
burnDVDROMtooBigTrash-msg = "The project won't currently fit onto a disc. But if you empty iMovie HD’s Trash, it may.";
burnDVDROMtooBigSorry-msg = "The project won't currently fit onto a disc. Try deleting some unused clips or music.";
burnDVDROMnonrecordableMedia-msg = "The inserted media isn't writable.";
burnDVDROMmediaTooSmall-msg = "The inserted media doesn't have enough free space to store project.";
burnDVDROMmediaNotBlank-msg = "The inserted media isn't blank.";
burnDVDROMnamefordisc = " Disc";
burnDVDROMUseDualLayerDVD-title = "Please use a dual layer DVD disc.";
burnDVDROMUseDualLayerDVD-msg = "Please make sure to use a dual layer DVD disc.  The project is larger than the capacity of a CD-ROM or single layer DVD disc.";
burnDVDROMUseDVDROM-title = "Please use a DVD disc";
burnDVDROMUseDVDROM-msg = "Please make sure to use a DVD disc. The project is larger than the capacity of a CD-ROM disc.";

/* Magic movie stuff */
magicMovie-defaultTransition = "Cross Dissolve";	/* WARNING: This must match the spelling of a transition */
magicMovie-noMusicSelected = "No music selected";
magicMovie-progressTitle = "Automatically importing and creating your movie.";
magicMovie-starting = "Starting...";
magicMovie-capturingVideo = "Capturing video...";
magicMovie-lookingForCamera = "Looking for DV Camera...";
magicMovie-sendingRewind = "Sending rewind command...";
magicMovie-sendingPlay = "Sending play command";
magicMovie-rewinding = "Rewinding...";
magicMovie-lookingForVideo = "Looking for video...";
magicMovie-addingTitle = "Adding title...";
magicMovie-addingTransitions = "Adding transitions...";
magicMovie-addingMusic = "Adding music...";
magicMovie-sendingToIDVD = "Sending to iDVD...";
magicMovie-sendingToIDVDWillTakeAFewMoments = "This may take a few moments.";
magicMovie-savingProject = "Saving project...";
magicMovie-adjustingVolume = "Adjusting volume level...";
magicMovie-endingClipName = "Ending";
magicMovie-sceneNameFormat = "Scene %d";

/* Magic movie, no camera alert */
magicMovie-NoCameraAlert-Title = "Video capture cannot begin, because a camera could not be found.";
magicMovie-NoCameraAlert-Message = "Make sure that your camera is connected to your computer, and turned on.";
magicMovie-NoCameraAlert-TryAgain = "Try Again";

/* Magic movie, bad camera mode alert */
magicMovie-BadCameraModeAlert-Title = "Video capture cannot begin, because the camera is not in the correct mode.";
magicMovie-BadCameraModeAlert-Message = "The camera must be in playback mode (sometimes referred to as VTR or VCR mode), and a tape must be in the camera. DV Bridges (tapeless devices) are not supported.";

/* Magic movie, can't save alert */
magicMovie-CantSaveAlert-Title = "The Magic iMovie could not be created, because your project could not be saved.";
magicMovie-CantSaveAlert-Message = "Make sure that your project is unlocked, is on a writable disk (not a CD-ROM), and that you have the correct permissions to save your project.";

/* "restore clip media" dialog box - args are timecode values */
restoreClipMedia-title = "Revert Clip To Original";
/* the argument here is one of the next three localized strings (bothMsg, beginMsg, or endMsg). */
restoreClipMedia-msg = "This will restore the underlying media that was trimmed or split from this clip. %@. Would you like to revert?\n";
/* all arguments are timecode values. */
restoreClipMedia-bothMsg = "(%@ available at the beginning of the clip, and %@ available at the end of the clip)";
restoreClipMedia-beginMsg = "(%@ available at the beginning of the clip)";
restoreClipMedia-endMsg = "(%@ available at the end of the clip)";

/* "title text lost" dialog */
titleTextLost-title = "Project Error";
titleTextLost-msg = "The title text for the selected clip is missing. Default text has been provided.";

defaultTitle-MyGreatMovie = "My Great Movie"; 	/* kMyGreatMovieStr  must be WorldScript-compatible */
defaultTitle-UserFmtString = "by %s"; 			/* kByUserFormatStr  must be WorldScript-compatible */
defaultTitle-line3 = "Starring"; 		/* kTitleThree  must be WorldScript-compatible */
defaultTitle-line4 = "Me";				/* kTitleFour  must be WorldScript-compatible */
/* kDefaultTitleBlockStr	 must be WorldScript-compatible */
defaultTitle-block = "<<copy/paste or type a block of text here, for use by some title effects that use a block of text>>";


/* clip info panel strings */
captureDateUnknown = "Unknown"; /* captured prior to 3.0 */
captureDateNA = "N/A"; /* audio clip selected, which has no capture date */

/* --- 1-click Movie strings ---
 this separator appears between song names on the 1-click Movie panel, when the user
 chooses more than one song. The trailer appears when there are more songs than
 room to list the name. */
ocmMusicPlaylistSeparator = ", ";
ocmMusicPlaylistTrailer = "and %d more";
ocmAuthProblemTitle = "Playlist Problem";
ocmAuthProblemMsg = "The playlist contains one or more songs which aren't authorized on this computer. Do you want to use just the authorized ones, or modify your playlist?";
ocmAuthProblemModify = "Modify Playlist";
ocmAuthProblemUseAuth = "Use Authorized Songs";


/* --- Strings that appear in progress dialogs --- */
/* this is what was STR_PROGRESS #2010, and various new iMovie 3.0 strings. */
kProgressLoadProject = "Loading “%@”";
kProgressLoadProjectThumbnails = "Loading Thumbnails";
kProgressLoadingThumbnailFormat = "Loading thumbnail for: “%@”";
kProgressExtractingAudioTitle = "Extracting Audio";
kProgressExtractingAudio = "Extracting audio from “%@”";
kProgressRenderSlowMotion = "Rendering Clips";
kProgressRenderSlowMotionFormat = "Rendering: “%@”";
kProgressExplodeFormatStr = "Converting “%@”";
/* trashing */
progressEmptyingTrash-Title = "Emptying Trash";
progressDeletingTrashItems = "Deleting files";
progressOpeningTrash-Title = "Opening Trash";
progressLoadingTrashClip = "Loading clip: %@";
/* time remaining strings */
progressTime-format = "Time remaining: %@";
progressTime-manyMinutes = "about %ld minutes";
progressTime-oneMinute = "about one minute";
progressTime-underOneMinute = "less than a minute";
/* string displayed in progress dialog when truncation occurs */
progressElipisString = "…";
progressBuildingMovie = "Building Movie";
progressLoadingMusic = "Loading Audio";
progressLoadingPhotos = "Loading Photos";
progressLoadingFonts = "Loading Fonts";
progressLoadingFontFormat = "Loading font: “%@”";
progressPasting = "Pasting";
progressSavingProject = "Saving Project";
progressSavingThumbnails = "Saving Thumbnails";
progressSavingTimeline = "Saving Timeline";
progressSavingProjectFile = "Saving Project File";
progressSavingReferenceMovie = "Saving QuickTime Movie";
progressBuildingMovieForClip = "Building movie for: “%@”";
progressLoadingThumbnailCache = "Loading saved thumbnails";
progressRenderingEffect = "Rendering Effect";
progressRenderingEffectForClip = "Rendering clip: “%@”";
progressFindingStrayFiles = "Searching for clips: “%@”";
progressCopyingPhotos = "Copying Photos";
progressCopyingPhotosUpperText = "Copying: “%@”";
progressSavingAs = "Saving as “%@”";
progressCopyingFilesForSaveAs = "Copying: “%@”";
progressAddingTitle = "Adding Title";

/* "explode clip" dialog */
explodeClip-title = "This effect generates different results for each frame, which will not show up on Still Clips.";
explodeClip-msg = "Do you want to convert selected Still Clips into regular clips to apply this effect?";
explodeClip-convertBtn = "Convert";
explodeClip-dontConvertBtn = "Don’t Convert";

/* importer messages */
/* importing         */
progressImport-Title = "Importing Files";
progressImport-preparing = "Preparing…";
progressImport-expanding = "Getting Folder Contents…";
progressImport-skipping = "Filtering Unusable Files…    (%@ of %@)";
progressImport-downloadingStart = "Downloading…";
progressImport-downloading = "Downloading (%@)"; /* arg 1: bytes downloaded (KB, MB, GB). */
importError-title = "Error during Import";
importError-msg = "The file could not be imported: %@"; /* argument is a reason string */
importProgress-upperTextFormat = "Importing “%@”    (%@ of %@)";	/* Example: Clip1.mov   (1 of 5) */
importFileNotFound = "The file could not be found.";
importCouldntDownload = "The URL “%@” couldn’t be downloaded.";
importOutOfDisk = "There is not enough disk space left to import %@";
importGenericError = "Unknown Error";
importFileTooBig = "The file “%@” is bigger than the maximum size supported.";
importStillCopyFailed-title = "Import Problem";
importStillCopyFailed-msg = "The still image file “%@” couldn’t be copied as a JPEG image. The clip has been imported, but you won’t be able to apply Ken Burns effects to it.";
importerQuicktimeParseError = "The file “%@” can’t be imported; QuickTime couldn’t parse it: %d";
importerUnauthorizedContent = "The file “%@” isn’t authorized for this computer.";

kenBurnsDiskFull-title = "Disk is full";
kenBurnsDiskFull-msg = "Rendering the selected image(s) requires about %@ of disk space. Only %@ is available.";
kenBurnsShowBtn = "Show Photo Settings";
kenBurnsHideBtn = "Hide Photo Settings";

/* "quit while rendering" dialog */
quitWhileRenderingMsg-title = "Rendering In Progress";
quitWhileRenderingMsg-oneFile = "An effect is still rendering and cannot be saved in the file.  Okay to stop rendering and remove these clips?";
quitWhileRenderingMsg-manyFiles = "%d effects are still rendering and cannot be saved in the file.  Okay to stop rendering and remove these clips?";
quitWhileRendering-btn = "Stop Rendering Clips";

/* disk space suffixes */
diskOrFileSize-KB = "KB"; /* must be WorldScript-compatible */
diskOrFileSize-MB = "MB"; /* must be WorldScript-compatible */
diskOrFileSize-GB = "GB"; /* must be WorldScript-compatible */

/* trash messages */
trashWindow-titleFormat = "Trash in %@";
/* Easy Trash emtpy alert - arg 1: bytes to be moved (MB, GB, etc) arg2: emptyTrashNote */
emptyTrashEasy-msg = "The Trash contains items totaling %@. %@";
/* Hard Trash empty alert. arg 1&2: bytes to be moved (MB, GB, etc) arg3: emptyTrashNote */
emptyTrashHard-msg = "The Trash contains items totaling %@. A total of %@ will need to be moved or copied for this operation; it may take as long as %s to complete. %@";
emptyTrashNote = "\nNOTE: after emptying the Trash, you will not be able to paste, undo steps, or restore the original media for any effects applied up to this point. Okay to Empty Trash?";
emptyTrashWhileRendering-title = "Unable To Empty Trash";
emptyTrashWhileRendering-msg = "You have titles, transitions or effects currently rendering. Please wait until they complete before emptying the Trash.";
emptyTrashLockedFiles-title = "Some files in the Trash are locked.";
emptyTrashLockedFiles-msg = "Would you like to unlock those files and continue?";
emptyTrashLockedFiles-btn = "Unlock and Continue";

/* Trash window strings */
trashWindow-trashCountSingular = "%ld item in Trash";
trashWindow-trashCountPlural = "%ld items in Trash";
trashWindow-trashSize = "%@ in Trash";
trashWindow-deleteButtonSingular = "Delete Selected Clip…";
trashWindow-deleteButtonPlural = "Delete Selected Clips…";

/* New empty trash warning */
emptyTrashWarning-title = "Are you sure you want to permanently delete all items in the trash of “%@”?";
emptyTrashWarning-msg = "You will not be able to Undo, Redo, Revert, Paste, or Restore Media after emptying the Trash. After the Trash is emptied, the project “%@” will be saved.";
emptyTrashWarning-button = "Empty Trash and Save Project";

/* Empty selected items in trash warning */
emptySelectedTrashWarning-title = "Are you sure you want to permanently delete the selected items?";
emptySelectedTrashWarning-msg = "You will not be able to Undo, Redo, Revert, Paste, or Restore Media after deleting the items. After the items are deleted, your project will be saved.";
emptySelectedTrashWarning-button = "Delete Items and Save Project";

/* Keyboard shortcut for the Empty Trash menu item. This can't be set in Interface Builder, so we do it programatically.
 This should probably not be localized, but I'm putting it here just in case. The \b sequence refers to the backspace
 key, and this is combined with Cmd-Shift at runtime to make Cmd-Shift-Backspace the final shortcut. */
emptyTrashKeyEquivalent = "\b";

/* --- camera capture window messages ---
 blue camera screen messages
 note: all the other messages are in EnumeratedStrings.plist */
unknownCameraState = "Camera State: %d / %d";
noCameraAttached = "No Camera Attached";
InitingSG = "Preparing Camera";
iSightIrisClosed = "iSight Iris Closed";
UnnamedHDVDeviceMenuName = "HDV Camera"; /* no known cameras for this yet. */
UnnamedDVDeviceMenuName = "DV Camera"; /* shown w/cams like Pana NV-MG3, TRV-7 */
appleUSBCam_marketingName = "Built-in iSight"; /* shown for built-in USB iSight camera */
/*CameraPickerMenuHelpItem = "Camera Help…"; */
CameraPickerOptionsItem = "Time Lapse…"; 
CaptureTimelapse-DVHelp = "Audio will be captured. The timelapse effect won’t be visible until you begin capturing to disk.";
CaptureTimelapse-HDVHelp = "No audio will be captured. The timelapse effect won’t be visible until after capture is complete.";
CaptureTimelapse-iSightHelp = "No audio will be captured. The timelapse effect won’t be visible until after capture is complete.";
CaptureTimelapse-OtherHelp = "Timelapse capture is not supported for this project format. Please create a DV, HDV, or iSight Project to use this feature.";
LowResFramesTitle = "Camera Problem";
LowResFramesMsg  ="The camera is sending half-sized frames, which iMovie HD can’t accept. Check your camera’s record mode (this is the setting that affects recording quality, which determines the total recording time on a tape). The mode must be set to “SP” or “LP.”  If that doesn't help, try removing all the cables and batteries from the camera, wait a minute, replace them, and then reset the date, time, and record mode.";
/* Timelapse-font controls the font used when the date and time are embedded in iSight captures when timelapse timestamps are turned on. If you are using a bold or black font (like "Arial-Black"), set the strokeFactor to 1.0. For ligher fonts, such as SIL-Hei-Med-Jian and HiraKakuPro-W3, set the stroke factor to 0.7, or the stroke will end up being thicker than the fill. */
Timelapse-font = "Arial-Black";
Timelapse-strokeFactor = "1.0";
/* The next 11 strings should not be localized - they set the color, and size
   of the Timelapse date/time stamp text.  */
Timelapse-small = "16";     /* DO NOT LOCALIZE */
Timelapse-medium = "24";    /* DO NOT LOCALIZE */
Timelapse-large = "36";     /* DO NOT LOCALIZE */
Timelapse-stroke-R = "1.0"; /* DO NOT LOCALIZE */
Timelapse-stroke-G = "1.0"; /* DO NOT LOCALIZE */
Timelapse-stroke-B = "1.0"; /* DO NOT LOCALIZE */
Timelapse-stroke-A = "1.0"; /* DO NOT LOCALIZE */
Timelapse-fill-R = "0.0";   /* DO NOT LOCALIZE */
Timelapse-fill-G = "0.0";   /* DO NOT LOCALIZE */
Timelapse-fill-B = "0.3";   /* DO NOT LOCALIZE */
Timelapse-fill-A = "1.0";   /* DO NOT LOCALIZE */

/* hidden, unsupported defaults for capture: 
	defaults write com.apple.iMovie allowDVwithSG -bool yes
Will cause DV devices to also show up as SequenceGrabber devices, which will make them available in iSight projects. All SG devices will have (SG) after their name. The main reason someone might want to use this is to do timelapse capture with embedded graphical timestamps using a DV camera as input. 
	defaults write com.apple.iMovie CaptureInModalWindow -bool no
Will allow you to capture in one window, while continuing to edit in another. Unless the computer is very fast, and the user very understanding of whats going on (e.g. dont start a bunch of renders or save a complicated project), this is a bad idea. It is completely untested. */

/* Import/record button text (below capture window)
 The import button only has two widths; the "import" width and the "iSight" width.
 the generic webcam text must be the same or shorter than the iSight width. */
importButtonDVGrabber = "Import";
importButtonSGGrabber-iSight = "Record With iSight";
importButtonSGGrabber = "Record With Camera"; /* the width of this string must be <= iSight string above! */

/* HDV capture messages displayed on G4's, other slow hardware */
HDVCaptureCompleting-title = "Completing Capture";
HDVCaptureCompleting-upper = "Processing cached HDV data";
HDVCaptureCompleting-lower = "Cancelling now won't delete existing clips.";

/* HDV capture messages displayed while HDV camera is playing back (lower right corner of preview window) */
HDVCaptureBuffer-Previewing = "Previewing";
HDVCaptureBuffer-Capturing = "Capturing";
/* 1st Argument is one of the two strings above, e.g. "Capturing" or "Previewing". */
HDVCaptureBuffer-FullSpeed = "%@ HD in real time";
HDVCaptureBuffer-ThreeQuarterSpeed = "%@ HD at 3/4 speed";
HDVCaptureBuffer-HalfSpeed = "%@ HD at 1/2 speed";
HDVCaptureBuffer-QuarterSpeed = "%@ HD at 1/4 speed";
HDVCaptureBuffer-SlowestSpeed = "%@ HD at 1/8 speed";

/* web camera/iSight messages */
WebCamNoMic-title = "No Microphone Detected";
WebCamNoMic-msg = "No microphone was found. Any created movies will be silent.";
iSightNoMic-title = "iSight Microphone Problem";
iSightNoMic-msg = "There's a problem accessing the iSight mic. Make sure no other applications are using it, or try disconnecting and reconnecting the iSight. If you record right now, your movies will be silent.";

/*Sequence Grabber Transcoding meesages */
TranscodingProgressTitle-DV-NTSC = "Converting Clip to DV NTSC";
TranscodingProgressTitle-DV-Wide = "Converting Clip to DV NTSC Wide";
TranscodingProgressTitle-DV-PAL = "Converting Clip to DV PAL";
TranscodingProgressTitle-DV-PAL-Wide = "Converting Clip to DV PAL Wide";
TranscodingProgressTitle-MPEG4 = "Converting Clip to MPEG-4";
TranscodingProgressTitle-iSight = "Converting Clip for iSight project";
TranscodingProgressTitle-720p30 = "Converting Clip to 720p 30 fps";
TranscodingProgressTitle-1080i30 = "Converting Clip to 1080i 30fps";
TranscodingProgressTitle-720p25 = "Converting Clip to 720p 25fps";
TranscodingProgressTitle-1080i25 = "Converting Clip to 1080i 25fps";
TranscodingProgressTitle-Default = "Converting Clip";
TranscodingProgressPreparing = "Preparing…";

/* ---- 'dont ask again' dialog boxes ------ */
/* "manual camera alert" dialog */
manualCameraAlert-title = "Your video camera is not responding to device control";
manualCameraAlert-msg = "If you are using a DV converter box, this is normal. You can manually control the camera using its built-in playback and recording buttons.";
/* "ConfirmReRenderInvalidTransitions" dialog */
confirmRenderInvalidTrans-title = "A transition must be re-rendered.";
confirmRenderInvalidTrans-msg = "This action will invalidate one or more transitions. Do you want to re-render the transitions?";

/* invalidated transition dialog */
transitionMustBeDeleted-title = "A transition must be deleted.";
transitionMustBeDeleted-msg = "This action will invalidate at least one transition. Invalid transitions will be deleted. Would you like to proceed?";
transitionMustBeDeleted-pasteMsg = "This action will invalidate at least one transition on the clipboard. Invalid transitions will not be pasted. Would you like to proceed?";

/* Share alert */
exportTimelineEmpty-title = "The movie could not be shared.\nThere are no clips in the timeline or there are no selected clips.";
exportTimelineEmpty-msg = "Drag some clips into the timeline to build a movie, or select the clips to be shared.";
exportTimelineHasProtectedAudioWithNoVideo-title = "The movie could not be shared.\nThere is protected audio in the timeline, but there is no video.";
exportTimelineHasProtectedAudioWithNoVideo-msg = "To share a project that contains protected audio, you must also include video.";

/* ---------------- strings that appear in the tabbed pane view --------------------- */

/* --- titles, transitions, and effects (e.g. plugins) --- */
PluginRequiredSelectedClips = "You must select %d clips to apply this effect or title";

/* --- iPhoto Browser --- */
MXEllipsis = "…";
MXIPhotoXMLNotFoundMenu = "iPhoto 2.0 or later not found";
MXIPhotoXMLNotFoundLibrary = "No photos were found.\nTo use this feature, you must first create\na photo library using iPhoto version 2.0 or later.";
MXIPhotoEmptyAlbumMenu = "No photos found.";
MXIPhotoEmptyAlbumView = "No photos in this album.";
MXIPhotoEmptyLibrary = "No photos were found in the master album.";
/* if more than one master list exists (mulitple databases), this is the format */
/* used, e.g. "Photo Library #1" */
MXIPhotoMasterListMultiFormat = "%@ #%d";

ApplyButton = "Apply";
UpdateButton = "Update";

/* sound effects folders */
skyWalker-soundEffects-title = "Skywalker Sound Effects";
standard-soundEffects-title = "Standard Sound Effects";
soundEffects-title = "iMovie HD Sound Effects";

/* --- iDVD Pane strings (chapter markers) --- */
launchingIDVD-title = "Launching iDVD…";
launchingIDVD-msg = "iMovie HD is launching iDVD; this may take a few moments.";
iDVDChapterLimit-title = "The chapter could not be added, because the movie already contains the maximum number of chapters.";
iDVDChapterLimit-msg = "A movie can only contain %d chapters.";
iDVDChapterNearby-title = "The chapter could not be added, because there is already a chapter near this location.";
iDVDChapterNearby-msg = "Chapters must be at least one second apart. Please move the playhead to a new location, and try again.";
iDVDChapterAtStart-title = "This chapter will automatically be moved to the beginning of the movie.";
iDVDChapterAtStart-msg = "Chapters within the first second of video must be placed at the very beginning.";
iDVDFirstChapterName = "Beginning";
iDVDURLPlaceholderName = "Link URL";
iDVDVersionRequired-title = "Compatible version of iDVD required";
iDVDVersionRequired-msg = "This feature requires iDVD version 4.0 or later.  Please refer to iMovie HD Help for information about using earlier versions of iDVD with iMovie HD.";
iDVDTimedOut-title = "Could not launch iDVD";
iDVDTimedOut-msg = "The iDVD application could not be launched properly.  Try launching iDVD from the Finder and then clicking the Create iDVD Project button again.";
/* DO NOT LOCALIZE - sets the max number of frames a URL will be on-screen in QT Player/iTunes/etc */
maxURLLinkDurationInFrames = "240";

/* -------------------- Error message strings ---------------------------- */
/* strings starting with 'k' are originally from iMovie 2.x, and were
   ported from the original resource-fork .rsrc format.  */

/* what was STR_INTERFACE #300 */
kInterfaceStrAudio = "%@ - Audio";	/* (audio clip name after extracting audio) */
kInterfaceSplitSelectedAudioClipAtPlayhead = "Split Selected Audio Clip at Playhead"; /* menu item */
kInterfaceSplitSelectedAudioClipsAtPlayhead = "Split Selected Audio Clips at Playhead"; /* menu item */
kInterfaceSplitVideoClipAtPlayhead = "Split Video Clip at Playhead"; /* menu item */
kInterfaceLockAudioClipAtPlayhead = "Lock Audio Clip at Playhead"; /* menu item */
kInterfaceUnlockAudioClip = "Unlock Audio Clip"; /* menu item */
kInterfaceBlack = "Black"; /* The initial name of a black video clip */
kInterfaceColor = "Color Clip"; /* The initial name of a color clip */

/* old STR_ERROR msgs */
kDestWriteError = "Error writing destination file";

/* old STR_ALERT msgs */
kGenericException = "An internal error has occurred. Please save your work and restart the program.";
kAlertStopMic = "End of Movie.  Microphone recording is complete.";
kAlertNoClipBefore = "This title or transition must be placed after an existing clip.";
kAlertNoClipAfter = "This title or transition must be placed before an existing clip.";
kAlertDiskFull = "You do not have enough remaining disk space for that operation.";
kAlertDiskFullExplain = "Try emptying the Trash or deleting unwanted files to get more space.";
kAlertDiskFullCantImportSoundFX = "There is not enough disk space for you to import a sound effect into your project.  Try emptying the Trash or delete unwanted files.";
kAlertDiskFullCantImportAIFFFile = "There is not enough disk space for you to import an AIFF file into your project.  Try emptying the Trash or delete unused files.";
kAlertCantOpenFile = "Can’t open file “%s”; skipping it and continuing.";
kAlertCantReadProject = "Your project file is not readable.";
kBadPluginAlert = "Something is wrong with the plugin %s.";
/* kOSErrExceptionAlert -- displayed when we can't figure out what went wrong */
kOSErrExceptionAlert = "Error in system operation.";
kAlertEmptyTrashFailed = "Error in emptying the Trash.";
kMissingPluginsAlert = 	"Missing Title or Transition plugins. Please re-install the application.";
kPleasePressRecordAlert = "Please press record on your camera to begin the export.";
kAlertPreviewMissingFrames = "There are not enough video frames around the playhead to preview the title, transition, or effect.";
/*kAlertSoundRecordFailure = "Error trying to record from Microphone.";
kAlertSoundRecordFailureExplain = "If you have Speakable Items turned on, turn it off in your control panel and try again."; */
kAlertCantUpdateShelfTitle = "Since that title is rendered over video frames, it can’t be updated while on the Shelf.";
kAlertDiskSpaceTooLowToRecord = "You only have %s of available disk space. You do not have enough space to record a new audio clip.";
kAlertCantDoThatWhileRendering = "You have titles or transitions currently rendering. Please wait until they have completed rendering.";
kAlertPasteWouldWreckTransition = "You can’t paste at the current playhead location because it would interfere with a transition.  Please move the playhead to another location or remove the transition.";
kAlertCantPasteTransitionsToShelf = "There are transition clips on the clipboard.  You can not paste transitions to the Shelf.";
kAlertDVFileWrongFormat = "The DV File “%s” is the wrong video standard and cannot be imported into this project.";
kAlertCantOperateOnRenderingClips = "That operation cannot be performed on rendering clips.  Please wait until they have completed rendering.";
kAlertNoVideoClipToLockTo = "Audio can only be locked to a video clip.  Please reposition the playhead and reselect Lock Audio Clip at Playhead.";
kAlertFileTooBig = "You have exceeded the system limit for the size of a single file. Operation cannot continue.";
kAlertMissingSoundEffect = "The sound effect file “%s” is missing or damaged.  Please re-install the application.";
kAlertInvalidAudioLocks = "This action will invalidate at least one audio lock in the project.  Invalid audio locks will be removed.  Do you want to proceed?";
kUndoStackException = "An error occurred while trying to make your last action undable. All undo operations have been thrown away.  Please save your project and restart the application.";
kSomeClipsTooShort = "One or more clips are too short to apply the desired transition.  Please try again after changing the Speed value.";
kExplainAutoAdjust = "Choose “Change automatically” if you would like iMovie HD to make Speed adjustments for you. ";
kChangeItForMe = "Change automatically";
kQTFileCompressionError = "A File Compression Error Occurred.";
kQTFileConvertMovieToFileError = "The movie could not be properly compressed.  The movie may contain some data that is invalid for the type of compression selected.";

/* kAlertFileTooSlow = "The disk is too slow";
kAlertFileTooSlowExplain = "The disk responded slowly. It may have been interruped by something, or it may not be fast enough for your movie. If you have a lot of audio clips, you might try muting the audio to see if that helps.";
*/
kAlertFileIOFailure = "Problem reading or writing the file";
kAlertFileIOFailureExplain = "The disk the file is on may be write-protected, full, or unavailable.";
/* KMH: moved from EnumeratedStrings.plist for 6.0 */
/* unknownErr used to be a memory error. The assumption under OS 9 was if you weren't sure what went wrong, it was RAM. */
unknownErr-Title = "An unknown error occurred.";
unknownErr-Msg = "You may be able to continue without any problems. You may also wish to save, quit, and re-launch iMovie HD.";
kAlertEffectTooLong = "The clip generated by this effect would exceed the application limit of one hour per file."; 
kAlertClipBeforeTooShort = "The clip before that title or transition is too short; it must be at least %s."; 
kAlertClipAfterTooShort = "The clip following the transition is too short; it must be at least %s."; 
kAlertBothClipsTooShort = "You cannot apply a transition between two very short clips. They must each be at least %s long.";
kAlertNoCamera = "Your FireWire camera is not powered on or is not available. This also can happen if you added or removed a device from FireWire. Please try again."; 
kAlertClipRendering = "You must wait until the render is complete. The action you are attempting needs those results.";
kAlertMovieTooShortAfterTitle =	"The title is too long for that part of the movie; please place it at least %s from the end of the movie."; 
kBadPluginAppTooOldAlert = "The application is too old to work correctly with the plugin %s.";
kBadPluginAppTooNewAlert = "The plugin file %s is too old to work correctly with this application.";
/* this message is displayed on non-powerPC hardware when a powerPC-only plugin is detected. */
Plugin-noIntel-Title = "Incompatible Plugin";
Plugin-noIntel-Msg = "The plugin “%@” cannot be loaded, because it isn't designed to run on this computer. If you don't need this plugin, remove it from your plugins folder (in Library > iMovie)";
Plugin-noIntel-StopLoadingButton = "Stop Loading Plugins";

/* what was STR_PROJECT_OPEN # 1708 -- used by plugins that need an external file. */
kProjectSelect = "Open";
kProjectOpenPrompt = "Open File";

/* what was STR_FILE_ERRORS # 1718 */
kFileErrEOF = "File %@ was too short and may have been damaged. Your project may be too damaged to edit.";
kFileErrNotFound = "File %@ was not found in the project. Your project may be too damaged to edit.";
kFileErrLocked = "File %@ is locked. Your project may be too damaged to edit.";

/* Sharing feature */
Share_DefaultFileName = "My Movie";
Share_CompressingMovie = "Compressing movie…";
Share_LaunchingMailApp = "Launching email application…";
Share_CopyingToiDisk = "Copying movie to iDisk…";

/* Share to Bluetooth */
ShareToBluetooth_GetDeviceReady = "Your movie will be compressed, and will require approximately %@ of space on your Bluetooth device. Please make sure that the device is turned on, and ready to receive the movie.";
ShareToBluetooth_BlueToothNotPoweredOn = "Your Bluetooth controller is not on. Please turn Bluetooth on via your System Preferences.";
ShareToBluetooth_NoBlueTooth = "No Bluetooth controller can be found on this system.  To use this feature, Bluetooth support is required.";
ShareToBluetooth_UnknownError = "An unknown error occurred.";

ShareToBluetooth_UnknownError_AlertTitle = "The movie could not be sent to the device, because the movie could not be saved to disk first.";
ShareToBluetooth_UnknownError_AlertMessage = "The disk that contains this project might be locked, or might be of out of space. (Error %d)";

/* Share to Bluetooth - Large movie alert */
ShareToBluetooth_LargeMovie_AlertTitle = "The movie that you are about to create will be large (approximately %@). Some Bluetooth devices won't allow messages this large.";
ShareToBluetooth_LargeMovie_AlertMessage = "If you have difficulty sending the movie, then consider sharing your movie on your .Mac Homepage, or share it using iDVD.";
ShareToBluetooth_LargeMovie_SendButton = "Send to Bluetooth Device…";

/* Share to Bluetooth - UI/Status related strings */
ShareToBluetooth_UIStatus_TransferCanceledByUserMessage = "Transfer canceled."; 
ShareToBluetooth_UIStatus_CompressionCanceledByUserMessage = "Compression canceled."; 
ShareToBluetooth_UIStatus_DaemonNotFoundMessage = "Error.  Bluetooth not set up properly."; 
ShareToBluetooth_UIStatus_ConnectingMessage = "Connecting To Bluetooth device…"; 
ShareToBluetooth_UIStatus_BadFileSpecified = "Error.  Cannot open/read file."; 
ShareToBluetooth_UIStatus_UnknownError = "An error has occurred."; 
ShareToBluetooth_UIStatus_InvalidTargetAddress = "Invalid target device selected."; 
ShareToBluetooth_UIStatus_PutFileError = "Send to target device failed."; 
ShareToBluetooth_UIStatus_ConnectionEstablished = "Connection with target device established."; 
ShareToBluetooth_UIStatus_ConnectionFailed = "Connection with target device failed."; 
ShareToBluetooth_UIStatus_TransferringLongStatus = "Sending file… %u%% Complete (%0u KB/s)."; 
ShareToBluetooth_UIStatus_TransferringQuickStatus = "Sending file…"; 
ShareToBluetooth_UIStatus_TransferringFailed = "Send file failed."; 
ShareToBluetooth_UIStatus_TransferringComplete = "Send file completed."; 
ShareToBluetooth_UIStatus_TransferAborted = "Send file stopped."; 
ShareToBluetooth_UIStatus_AbortingTransfer = "Stopping send file…"; 
ShareToBluetooth_UIStatus_TransferRefused = "Send file refused by target device."; 
ShareToBluetooth_UIStatus_Disconnecting = "Disconnecting…"; 
ShareToBluetooth_UIStatus_Idle = "Idle."; 

/* Share to Mail */
ShareToMail_DefaultMailApp = "Mail";
ShareToMail_DefaultSubject = "My Movie";
ShareToMail_UnableToSendEmail_AlertTitle = "The email could not be sent, because an error occurred while starting the email application.";

/* Share to Mail - Unknown error alert */
ShareToMail_UnknownError_AlertTitle = "The email could not be sent, because the movie could not be saved to disk.";
ShareToMail_UnknownError_AlertMessage = "The disk that contains this project might be locked, or might be of out of space. (Error %d)";

/* Share to Mail - Large email alert */
ShareToMail_LargeMailMovieISPWarning = "Some Internet Service Providers will not support emails this large. If you have difficulty sending the email, then consider sharing the movie on your HomePage.";

/* Share to Mail - Can't launch email app */
ShareToMail_CantLaunchEmailApp_AlertTitle = "The message could not be sent, because %@ could not be launched.";
ShareToMail_CantLaunchEmailApp_AlertMessage = "You may need to reinstall %@, or try a different email application";

/* Share to Camera */
ShareToCamera_disabled_iSight = "You cannot share iSight-format projects to a video camera.";
ShareToCamera_SaveStreamHelpText = "No device needs to be attached to save the stream to a file.";
/* if there are no cameras/TV's attached, this appears after "Attached Devices" in the help box */
ShareToCamera_NoDevices = "none";
ShareToCamera_DeviceSeparator = ", "; /* appears between devices if more than one is attached */

/* Share to iDVD */
ShareToiDVD_LowDisk_AlertTitle = "Disk Space is Running Low";
ShareToiDVD_LowDisk_AlertMessage = "Burning this movie to DVD will require approximately %@ of disk space, which is less than you have right now. If you proceed, the burn in iDVD may fail. Either save the iDVD project to another disk, or free some space first.";
ShareToiDVD_LowDisk_ContinueAnyway = "Continue Anyway";
ShareToiDVD_UnknownError_AlertTitle = "The movie could not be sent to iDVD, because of an unknown error.";
ShareToiDVD_UnknownError_AlertMessage = "Please make sure that iDVD is properly installed, that your project disk has write permission, and that you have enough disk space. (Error %d)";

/* Share to GarageBand */
ShareToGarageBand_UnknownError_AlertTitle = "The movie could not be sent to GarageBand, because of an unknown error.";
ShareToGarageBand_UnknownError_AlertMessage = "Please make sure that GarageBand is properly installed, that your project disk has write permission, and that you have enough disk space. (Error %d)";
launchingGarageBand-title = "Launching GarageBand…";
launchingGarageBand-msg = "iMovie HD is launching GarageBand; this may take a few moments.";
GarageBandVersionRequired-title = "Compatible version of GarageBand required";
GarageBandVersionRequired-msg = "This feature requires GarageBand version 3.0 or later.  Please refer to iMovie HD Help for information about using earlier versions of GarageBand with iMovie HD.";
GarageBandTimedOut-title = "Could not launch GarageBand";
GarageBandTimedOut-msg = "The GarageBand application could not be launched properly.  Try launching GarageBand from the Finder.";

/* Share to iWeb */
ShareToiWeb_UnknownError_AlertTitle = "The movie could not be sent to iWeb, because of an unknown error.";
ShareToiWeb_UnknownError_AlertMessage = "Please make sure that iWeb is properly installed, that your project disk has write permission, and that you have enough disk space. (Error %d)";
launchingiWeb-title = "Launching iWeb…";
launchingiWeb-msg = "iMovie HD is launching iWeb; this may take a few moments.";
iWebVersionRequired-title = "Compatible version of iWeb required";
iWebVersionRequired-msg = "This feature requires iWeb version 1.0 or later.  Please refer to iMovie HD Help for information about using iWeb with iMovie HD.";
iWebTimedOut-title = "Could not launch iWeb";
iWebTimedOut-msg = "The iWeb application could not be launched properly.  Try launching iWeb from the Finder.";

/* Share to iTunes */
ShareToiTunes_UnknownError_AlertTitle = "The movie could not be sent to iTunes, because of an unknown error.";
ShareToiTunes_UnknownError_AlertMessage = "Please make sure that iTunes is properly installed, that your project disk has write permission, and that you have enough disk space. (Error %d)";
launchingiTunes-title = "Launching iTunes…";
launchingiTunes-msg = "iMovie HD is launching iTunes; this may take a few moments.";
iTunesVersionRequired-title = "Compatible version of iTunes required";
iTunesVersionRequired-msg = "This feature requires iTunes version 1.0 or later.  Please refer to iMovie HD Help for information about using iTunes with iMovie HD.";
iTunesTimedOut-title = "Could not launch iTunes";
iTunesTimedOut-msg = "The iTunes application could not be launched properly.  Try launching iTunes from the Finder.";

/* Share to QuickTime */
ShareToQT_FnfError_AlertTitle = "The movie could not be sent to QuickTime, because a file couldn't be found.";
ShareToQT_FnFError_AlertMessage = "Please make sure that your project disk has write permission, and that you have enough disk space. This error can also be caused by some third-party iMovie HD plugins. If you have added plugins:\n1) Quit iMovie HD.\n2) Find your installed plugins. They're usually in a folder called “iMovie” in your “Library” folder.\n3) Rename the plugins folder  “iMovie0”.\n4) Launch iMovie HD and try sharing again.\nWhen you're done sharing, you may change the folder name back to “iMovie” so the plugins are available again.\nVisit http://support.apple.com/ for more information on this issue.";
ShareToQT_UnknownError_AlertTitle = "The movie could not be sent to QuickTime, because of an unknown error.";
ShareToQT_UnknownError_AlertMessage = "Please make sure that your project disk has write permission, and that you have enough disk space. (Error %d)\n";

/* Shared share messages */
Share_DiskFullError_Title = "Your disk is full";
Share_DiskFullError_Msg = "The movie could not be shared because there is no room to save it. Try deleting unused files, emptying the trash, or moving the project to a disk with more space.";

/* Bookmarks */
Bookmarks_DeleteAll_AlertTitle = "Are you sure you wish to delete all of the bookmarks?";
Bookmarks_DeleteAll_DeleteButton = "Delete Bookmarks";

/* Menu item for switching between view modes */
SwitchToTimelineViewer = "Switch to Timeline Viewer";
SwitchToClipViewer = "Switch to Clip Viewer";

/* Can't open project because of permisssion alert */
CantOpenNoWritePermission_AlertTitle = "The project could not be opened, because the disk is full, the folder is locked, or the folder permission are incorrect.";
CantOpenNoWritePermission_AlertMessage = "If the project is on a CD-ROM, network server, or locked disk, then copy it to your hard drive before opening it.\n\nIf the project is already on your hard disk, then the disk may be completely full, or you may not have permission to modify that folder. Correct the problem and try again.";

/* Can't open project because too many projects are already open */
CantOpenTooManyOpen-Title = "Can’t open any more projects";
CantOpenTooManyOpen-Msg = "There are too many projects open already. Please close a few, then try again.";

/* Preferences toolbar items */
PrefsToolbar_General = "General";
PrefsToolbar_Importing = "Import";
PrefsToolbar_Playback = "Playback";
/* text next to radio buttons on the playback tab when 720p or 1080i HDV project is open */
PrefsQuality_HDV720pHigh = "High (medium resolution)";
PrefsQuality_HDV720pHighest = "Highest (highest resolution)";
PrefsQuality_HDV1080iHigh = "High (high resolution in small windows)";
PrefsQuality_HDV1080iHighest = "Highest (best resolution for window size)";

/* New project save-as panel */
NewProjectSaveAsPanel_Title = "Create Project";
NewProjectSaveAsPanel_ProjectNameLabel = "Project:";
NewProjectSaveAsPanel_CreateButton = "Create";

/* Save-as panel */
SaveAsPanel_Title = "Save As…";

/* Not enough space for save-as alert */
NotEnoughSpaceForSaveAs_AlertTitle = "The project can’t be saved to the specified location, because there isn’t enough disk space.";
NotEnoughSpaceForSaveAs_AlertMessage = "Save to a different disk, or try to make more disk space available by emptying the trash.";

/* Replace folder alert */
ReplaceFolderAlert_Title = "Are you sure you want to replace the folder “%@”?";
ReplaceFolderAlert_Message = "The old folder will be moved into the Finder’s Trash.";
ReplaceAlert_ReplaceButton = "Replace";

/* Replace file alert */
ReplaceFileAlert_Title = "Are you sure you want to replace the file “%@”?";
ReplaceFileAlert_Message = "The old file will be moved into the Finder’s Trash.";

/* Unable to replace folder alert */
UnableToReplaceFolderAlert_Title = "Unable to replace the folder “%@”.";
UnableToReplaceFolderAlert_Message = "The folder or it's contents might be locked, or you may not have the correct permissions to delete it.";

/* Unable to replace file alert */
UnableToReplaceFileAlert_Title = "Unable to delete the file “%@”.";
UnableToReplaceFileAlert_Message = "The file might be locked, or you may not have the correct permissions to delete it.";

/* Can't replace current project alert */
CantReplaceCurrentProjectAlert_Title = "The project “%@” cannot be created, because there is already an open project with the same name at that location.";
CantReplaceCurrentProjectAlert_Message = "Close the current project first, or choose a different name or location.";

/* Upgrade checking mechanism */
/* application will fill in the version number (i.e.: "4.0.2") */
WebUpgradeNoNewUpdates = "This version of iMovie HD (%1$@) is the current version.";  
WebUpgradeNetworkError = "The iMovie HD update server could not be contacted. Please check your Internet connection or try again later.";
WebUpgradeDialogTitle = "iMovie HD Update";
WebUpgradeCheckingText = "Checking for updates...";

Fast_Slow_Reverse = "Fast/Slow/Reverse";
SpeedLabel = "Speed:";
FasterLabel = "Faster";
SlowerLabel = "Slower";

/* Bad volume alert */
BadVolume_AlertTitle = "The volume is out of range.";
BadVolume_AlertMessage = "The volume must have a value between %ld and %ld. It will be set to %ld.";

/* Effects Preview */
PluginPreview_PauseButton = "Pause";
PluginPreview_PlayButton = "Play";

/* Themes */
ThemePreview_ShowButton = "Show Preview";
ThemePreview_HideButton = "Hide Preview";
DropZone_WindowTitle = "Drop Zones";
DropZone_ShowButton = "Show Drop Zones";
DropZone_HideButton = "Hide Drop Zones";
DropZone_PictureLabel = "Picture %d";
ThemeProgress_Applying = "Applying “%@”";

/* Min/Max labels */
Min_Label = "Min";
Max_Label = "Max";

/* Quartz Composition plugin display names */
Quartz_Composer = "Quartz Composer";
Effect_ColorTV.qtz = "Color TV";
Effect_FocusOnCenter.qtz = "Peephole";
Effect_Negative.qtz = "Negative";
Effect_Newspaper.qtz = "Newspaper";
Effect_OldBlackAndWhite.qtz = "Old Black And White";
Effect_Saturate.qtz = "Saturate";
Effect_WaterColor.qtz = "Water Color";

/* Sound Effect Names and Durations */
/* Standard Sound Effects */
Std_SE_Alarm_Name = "Alarm";
Std_SE_Alarm_Duration = "5";
Std_SE_Bark_Name = "Bark";
Std_SE_Bark_Duration = "2";
Std_SE_BellTower_Name = "Bell Tower";
Std_SE_BellTower_Duration = "10";
Std_SE_Bubbles_Name = "Bubbles";
Std_SE_Bubbles_Duration = "10";
Std_SE_CartoonBoing_Name = "Cartoon Boing";
Std_SE_CartoonBoing_Duration = "1";
Std_SE_Crickets_Name = "Crickets";
Std_SE_Crickets_Duration = "9";
Std_SE_FootSteps_Name = "Footsteps";
Std_SE_FootSteps_Duration = "13";
Std_SE_HardRain_Name = "Hard Rain";
Std_SE_HardRain_Duration = "10";
Std_SE_JetFlyBy_Name = "Jet Fly By";
Std_SE_JetFlyBy_Duration = "9";
Std_SE_RaceCarDriveBy_Name = "Race Car Drive By";
Std_SE_RaceCarDriveBy_Duration = "2";

/*Skywalker Sound Effects */
Sky_SE_Birds_Name = "Birds";
Sky_SE_Birds_Duration = "7";
Sky_SE_ColdWind_Name = "Cold Wind";
Sky_SE_ColdWind_Duration = "31";
Sky_SE_Creek_Name = "Creek";
Sky_SE_Creek_Duration = "32";
Sky_SE_Electricity_Name = "Electricity";
Sky_SE_Electricity_Duration = "29";
Sky_SE_Elephant_Name = "Elephant";
Sky_SE_Elephant_Duration = "2";
Sky_SE_EngineRevs_Name = "Engine Revs";
Sky_SE_EngineRevs_Duration = "13";
Sky_SE_FilmProjector_Name = "Film Projector";
Sky_SE_FilmProjector_Duration = "22";
Sky_SE_Foreboding_Name = "Foreboding";
Sky_SE_Foreboding_Duration = "52";
Sky_SE_Gallop_Name = "Gallop";
Sky_SE_Gallop_Duration = "29";
Sky_SE_Gong_Name = "Gong";
Sky_SE_Gong_Duration = "4";
Sky_SE_IndoorBoo_Name = "Indoor Boo";
Sky_SE_IndoorBoo_Duration = "6";
Sky_SE_IndoorChuckle_Name = "Indoor Chuckle";
Sky_SE_IndoorChuckle_Duration = "4";
Sky_SE_IndoorLaugh_Name = "Indoor Laugh";
Sky_SE_IndoorLaugh_Duration = "14";
Sky_SE_Jungle_Name = "Jungle";
Sky_SE_Jungle_Duration = "53";
Sky_SE_Monkey_Name = "Monkey";
Sky_SE_Monkey_Duration = "4";
Sky_SE_OutdoorBoo_Name = "Outdoor Boo";
Sky_SE_OutdoorBoo_Duration = "11";
Sky_SE_OutdoorCheer_Name = "Outdoor Cheer";
Sky_SE_OutdoorCheer_Duration = "9";
Sky_SE_SqueakyDoor_Name = "Squeaky Door";
Sky_SE_SqueakyDoor_Duration = "5";
Sky_SE_SteamTrain_Name = "Steam Train";
Sky_SE_SteamTrain_Duration = "26";
Sky_SE_Suspense_Name = "Suspense";
Sky_SE_Suspense_Duration = "57";
Sky_SE_Thunder_Name = "Thunder";
Sky_SE_Thunder_Duration = "10";
Sky_SE_TickingClock_Name = "Ticking Clock";
Sky_SE_TickingClock_Duration = "21";
Sky_SE_Tiger_Name = "Tiger";
Sky_SE_Tiger_Duration = "4";
Sky_SE_TireSkids_Name = "Tire Skids";
Sky_SE_TireSkids_Duration = "2";
Sky_SE_Typewriter_Name = "Typewriter";
Sky_SE_Typewriter_Duration = "7";
Sky_SE_Xylophone_Name = "Xylophone";
Sky_SE_Xylophone_Duration = "4";

Sky_SE_BoatBell_Name = "Boat Bell";
Sky_SE_BoatBell_Duration = "4";
Sky_SE_ChampagneCork_Name = "Champagne Cork";
Sky_SE_ChampagneCork_Duration = "1";
Sky_SE_CityMorning_Name = "City Morning";
Sky_SE_CityMorning_Duration = "45";
Sky_SE_Coyote_Name = "Coyote";
Sky_SE_Coyote_Duration = "4";
Sky_SE_Heartbeat_Name = "Heartbeat";
Sky_SE_Heartbeat_Duration = "31";
Sky_SE_HeavyDoor_Name = "Heavy Door";
Sky_SE_HeavyDoor_Duration = "11";
Sky_SE_HorseWhinny_Name = "Horse Whinny";
Sky_SE_HorseWhinny_Duration = "2";
Sky_SE_ScaryAccent_Name = "Scary Accent";
Sky_SE_ScaryAccent_Duration = "12";
Sky_SE_SchoolYard_Name = "School Yard";
Sky_SE_SchoolYard_Duration = "31";
Sky_SE_Splash_Name = "Splash";
Sky_SE_Splash_Duration = "2";
Sky_SE_Stardust_Name = "Stardust";
Sky_SE_Stardust_Duration = "4";
Sky_SE_WavesLapping_Name = "Waves Lapping";
Sky_SE_WavesLapping_Duration = "42";
Sky_SE_TigerGrowl_Name = "Tiger Growl";
Sky_SE_TigerGrowl_Duration = "7";



